{"data":{"site":{"siteMetadata":{"title":"Blog by AnhTus","subtitle":"Imagination more important than knowledge. Knowledge is limited. Imagination encircles the world\n      \n      from \"Albert Einstein\"\n      ","copyright":"© All rights reserved.","author":{"name":"Vu Anh Tu","twitter":"VuAnhTus"},"disqusShortname":"anhtus","url":"https://vuanhtu1993.github.io/blog/"}},"markdownRemark":{"id":"03c23505-f809-59f7-80ae-9a15a0aa3133","html":"<h3>1. What is the Graphic Design ?</h3>\n<blockquote>\n<p>Graphic design is process of visual communication and problem-solving using one or more of typography, photography and illustration\nGD được chia thành 2 phần là graphic và design</p>\n</blockquote>\n<ul>\n<li>\n<p>Graphic là visual (trực quan) là sự thể hiện các thành phần cơ bản qua các công việc như vẽ, đổ màu, viết chữ, sắp xếp các thành phần cơ bản để thể hiện đươc ý tưởng của nội dung</p>\n</li>\n<li>\n<p>Design: là việc thiết kế cách nhìn, phương thức vật trước khi tạo ra chúng, design là thể hiện sự sáng tạo, giải quyết vấn đề và tính thực tiễn của bản vẽ\nDesign principles gồm có: Contract, Alignment, Repetition, Proximity, Hierarchy, Balance, Simplicity và Functions</p>\n</li>\n<li>\n<p>Khi kết họp các thành phần cở bản của Graphic: Line, Shape, Color, Texture, Space, Form, Typography cùng với các Design principles ta sẽ được GD</p>\n</li>\n<li>\n<p>Tóm lại: GD không phải là tạo ra thứ gì đó đẹp, làm post, icon mà GD là việc sắp xếp, tổ chức và thể hiện thông tin thông qua quá trình sáng tạo cho từng chức năng cụ thể\nĐể làm được như vậy càn phải hiểu nội dung muốn truyền đạt là gì, hiểu thông tin, </p>\n<h3>2. Graphic Elements</h3>\n<blockquote>\n<p>Là các thành phần cơ bản để tạo ra một bản thiết kế</p>\n</blockquote>\n<h4>Line</h4>\n<h3>3. Principles of design</h3>\n<h4>Contract</h4>\n<blockquote>\n<p>The difference between lights and darks in the image</p>\n</blockquote>\n</li>\n<li>\n<p>Make it stand out: Attract attention to the visual without overdoing it\n*Balance your elements: Make the important things more prominent, and the less important things less prominent</p>\n</li>\n</ul>\n<h4>Repetition</h4>\n<ul>\n<li>Similar elements: similar shapes, word, themes or pattern</li>\n</ul>\n<h4>Alignment</h4>\n<ul>\n<li>All elements should line up </li>\n</ul>\n<h4>Proximity</h4>\n<ul>\n<li>Things that are related should be grouped together, things are not related should be separated</li>\n</ul>","fields":{"tagSlugs":["/tags/ui-ux/","/tags/web-development/"]},"frontmatter":{"title":"CRAP design fundamental","tags":["UI/UX","Web Development"],"date":"2019-02-18T00:00:00.000Z","description":"CRAP design fundamental for beautiful life"}}},"pageContext":{"slug":"/posts/CRAP-fundamental-design/"}}