{"data":{"site":{"siteMetadata":{"title":"Blog by AnhTus","subtitle":"Imagination more important than knowledge. Knowledge is limited. Imagination encircles the world\n      \n      from \"Albert Einstein\"\n      ","copyright":"© All rights reserved.","author":{"name":"Vu Anh Tu","twitter":"VuAnhTus"},"disqusShortname":"anhtus","url":"https://vuanhtu1993.github.io/blog/"}},"markdownRemark":{"id":"18380644-873b-5752-bb3a-d590040079f1","html":"<h2>Webpack là gì ?</h2>\n<ul>\n<li>\n<p>Chắc hẳn bạn là người mới làm quen với front-end sử dụng các library hoặc framework js sẽ thường có các câu hỏi\nnhư là nó để làm gì, taị sao phải phức tạp nó ên như thế…</p>\n</li>\n<li>\n<p>Definition 1: <code class=\"language-text\">Webpack</code> là một <code class=\"language-text\">module loader</code> cho javascript</p>\n</li>\n<li>\n<p>Definition 2: <code class=\"language-text\">module loader</code> là một công cụ để quản lí <code class=\"language-text\">import</code> của các thư viện js, merge chúng tại với nhau\nđể tạo ra một hoặc một vài file bundle</p>\n<ul>\n<li>Tại sao lại cần dùng module loader: Hiện tại thế giới front-end không giống như là HTML, CSS, JQuery là\ncân được thế giới như ngày xưa nữa. Khi thực hiện một dự án React, Vue hay Angular chúng ta phải sử dụng\nrất nhiều các thư viện khác mà cứ để vào thẻ <code class=\"language-text\">&lt;script/&gt;</code> như trước chắc chắn là ko ổn cũng như hiệu năng<br>\nbị hạn chế => Module loader ra đời</li>\n</ul>\n</li>\n<li>\n<p>Definition 3: <code class=\"language-text\">Loader</code> nà gì?. Là những thư viện mà webpack cho phép can thiệp trước khi <code class=\"language-text\">import</code> files.\nCho phép không chỉ bundle js files mà cả nhưng static như css, image … (Vậy nghĩa là muốn bundle cái gì\nthì làm ơn install loader cái đấy vào nhá)\nVD một số Loader: <code class=\"language-text\">style-loader</code>, <code class=\"language-text\">babel-loader</code> max phổ biến <code class=\"language-text\">file-loader</code>…</p>\n</li>\n<li>\n<p>babel-loader: làm nhiệm vụ transpile ES6 -> ES5 vậy muốn bundle js thì cho web hiểu thì cần babel-loader\nchạy trước webpack (giờ còn ai không viết es6 nữa giơ tay nào để bỏ bố cái thằng này đi)</p>\n</li>\n<li>\n<p>style-loader: Như đã nói ở phần định nghĩa loader, style loader là một thư viện nhằm nâng cao khả năng của\nwebpack không chỉ bundle js mà còn bundle cả style (đơn giản là nhét vào thẻ s)</p>\n</li>\n<li>\n<p>file-loader: tượng tự như style-loader, nhưng là để bundle static file</p>\n</li>\n<li>\n<p>Sass/scss-loader: Lại là một thư viện dể tiền sử lí trước style-loader</p>\n<ul>\n<li>sass-loader transforms Sass thành CSS.</li>\n<li>css-loader parses CSS vào JavaScript và resolve dependencies.</li>\n<li>style-loader chèn CSS vào bên trong thẻ <style></li>\n</ul>\n</li>\n</ul>","fields":{"tagSlugs":["/tags/react/","/tags/web-development/","/tags/webpack/"]},"frontmatter":{"title":"Webpack and style-loader for React developer","tags":["React","Web Development","Webpack"],"date":"2019-03-10T00:00:00.000Z","description":"More understanding about webpack, especially style-loader, why we need to use them"}}},"pageContext":{"slug":"/posts/webpack-and-style-loader/"}}